#define _USE_MATH_DEFINES
#include <stdio.h>
#include <math.h>
#include <stdlib.h>
#include <string.h>

void task32(), task39(), task58(), task95(), task43(), task21(), task35(), task91(), task82(), task14();

int main() {
	int K = 16, N;

	srand(time(NULL));

	printf("Мої завдання: ");
	
	for (N = 1; N <= 10; N++) {
		int num = ((N * N * N + K * K) % 113) + 1;
		printf("%d", num);

		if (N < 10) {
			printf(", ");
		}
		else {
			printf(".");
		}
	}

	task32(), task39(), task58(), task95(), task43(), task21(), task35(), task91(), task82(), task14();

	return 0;
}

void task32() {
	printf("\n\nЗавдання 32: Підрахувати кількість цілих серед чисел a, b, c");

	double a = (rand() % 200) / 2.0 - 100, b = (rand() % 200) / 10.0 - 10, c = (rand()% 200) / 3.0 - 30;

	int numberOfIntegers = 0;

	if (a == (int)a) {
		numberOfIntegers++;
	}

	if (b == (int)b) {
		numberOfIntegers++;
	}

	if (c == (int)c) {
		numberOfIntegers++;
	}

	printf("\n\n    Враховуючи те, що а = %.2f, b = %.2f, c = %.2f ми отримали рівно %d цілих чисел.", a, b, c, numberOfIntegers);
}

void task39() {
	printf("\n\nЗавдання 39: Скласти програму, що визначає результат ворожіння на ромашці(<<любить - не любить>>), взявши за вихідну дану кількість пелюстків n");
	
	int n = (rand() % 100) + 1;

	printf("\n\n    Оскільки пелюстків всього %d, ми маємо результат ворожіння: ", n);

	if (n % 2 == 0) {
		printf("не любить.");
	}
	else {
		printf("любить.");
	}
}

void task58() {
	printf("\n\nЗавдання 58: Дано три точки A(x1, y1), B(x2, y2), і C(x3, y3). Визначити, чи вони розсташовані на одній прямій. Якщо ні, то обчислити кут B.");
	double x1 = (rand() % 10), x2 = (rand() % 10), x3 = (rand() % 10), y1 = (rand() % 10), y2 = (rand() % 10), y3 = (rand() % 10);

	if (x1 * (y2 - y3) + x2 * (y3 - y1) + x3 * (y1 - y2) == 0) {
		printf("\n    Введені точки A(%.0f, %.0f), B(%.0f, %.0f) i C(%.0f, %.0f) розсташовані на одній прямій.", x1, y1, x2, y2, x3, y3);
	}
	else {
		printf("\n    Введені точки A(%.0f, %.0f), B(%.0f, %.0f) i C(%.0f, %.0f) розсташовані не на одній прямій.", x1, y1, x2, y2, x3, y3);

		double xBA, yBA, xBC, yBC, productOfVectors;
		xBA = x1 - x2;
		yBA = y1 - y2;
		xBC = x3 - x2;
		yBC = y3 - y2;
		
		printf("\n    Враховуючи це, нам потрібно знайти кут B. Для цього нам знадобляться вектора BA(%.0f, %.0f) і BC(%.0f, %.0f).", xBA, yBA, xBC, yBC);

		productOfVectors = xBA * xBC + yBA * yBC;

		double sqrtBA, sqrtBC, cosB, rad, deg;
		sqrtBA = sqrt(xBA * xBA + yBA * yBA);
		sqrtBC = sqrt(xBC * xBC + yBC * yBC);
		cosB = productOfVectors / (sqrtBA * sqrtBC);

		if (cosB > 1) {
			cosB = 1;
		}

		if (cosB < -1) {
			cosB = -1;
		}

		rad = acos(cosB);
		deg = rad * (180.0 / M_PI);

		printf("\n    Кут B = %.2f", deg);
	}
}

void task95() {
	printf("\n\nЗавдання 95: Є стіл прямокутної форми з розмірами a x b(a i b - Цілі числа, a > b) та кістки доміно з розмірами c x d x e(c, d i e - Цілі числа, c > d > e). Знайти варіант розміщення на столі найбільшої кількості кісток. Всі кістки, що розміщуються, повинні лежати на одній і тій же грані в один ярус і не звисати зі столу. Всі ребра кісток доміно повинні бути паралельними або перпендикулярними кожній стороні столу.");
	int a, b, c, d, e, swap;
	a = rand() % 100 + 10; b = rand() % 100 + 10; c = rand() % 10 + 1; d = rand() % 10 + 1; e = rand() % 10 + 1;

	if (a < b) {
		swap = a, a = b, b = swap;
	}

	if (d < e) {
		swap = d, d = e, e = swap;
	}
	if (c < d) {
		swap = c, c = d, d = swap;
	}
	if (d < e) {
		swap = d, d = e, e = swap;
	}
	printf("\n    Вхідні дані: a = %d, b = %d, c = %d, d = %d, e = %d.", a, b, c, d, e);
	printf("\n    Розміри столу %d x %d, а доміно - %d x %d x %d.", a, b, c, d, e);
	int way1, way2, maxDice;

	way1 = (a / d) * (b / e);
	way2 = (a / e) * (b / d);

	if (way1 > way2) {
		maxDice = way1;
	}
	else {
		maxDice = way2;
	}

	printf("\n    Враховуючи те, що кістки не повинні виходити за край стола, всього є два способи їх розміщення - сторонами a-d, b-e і сторонами a-e, b-d. Перший спосіб надає нам змогу укласти %d кісток, другий %d. Отже, максимальна кількість кісток на столі - %d.", way1, way2, maxDice);
}


void task43() {
	printf("\n\nЗавдання 43: Скласти програму, яка визначає, чи пройде графік функції y = a * a + b * x + c через задану точку з координатами (m, n)");
	double a = rand() % 8, b = rand() % 6, c = rand() % 10, m = rand() % 2, n = rand() % 3, y;

	printf("\n    Маємо рівняння: y = %.0f * %.0f + %.0f * %.0f + %.0f; точка (%.0f, %.0f).", a, a, b, m, c, m, n);

	y = a * a + b * m + c;

	if ((int)y == n) {
		printf("\n    Графік функції проходить через точку (%.0f, %.0f).", m, n);
	}
	else {
		printf("\n    Графік функції не проходить через точку (%.0f, %.0f).", m, n);
	}
}

void task21() {
	printf("\n\nЗавдання 21: Дано чотиризначне число. Визначити: а) чи дорівнює сума двох перших його цифр сумі двох його останніх цифр; б) чи трьома сума його цифр; в) кратно чи чотирьом добуток його цифр; г) кратно чи добуток його цифр числу a.");
	double a = rand() % 9 + 1, b = rand() % 9 + 1, c = rand() % 9 + 1, d = rand() % 9 + 1;

	printf("\n    Число: %.0f%.0f%.0f%.0f.", a, b, c, d);

	if (a + b == c + d) {
		printf("\n    а)Сума двох його перших цифр дорівнює сумі двох його останніх цифр(%.0f = %.0f).", a + b, c + d);
	}
	else {
		printf("\n    a)Сума двох його перших цифр НЕ дорівнює сумі двох його останніх цифр(%.0f це не %.0f).", a + b, c + d);
	}

	if ((int)(a + b + c + d) % 3 == 0) {
		printf("\n    б)Сума всіх його цифр кратна трьом(%.0f + %.0f + %.0f + %.0f = %.0f).", a, b, c, d, a + b + c + d);
	}
	else {
		printf("\n    б)Сума всіх його цифр НЕ кратна трьом(%.0f + %.0f + %.0f + %.0f = %.0f).", a, b, c, d, a + b + c + d);
	}

	if ((int)(a * b * c * d) % 4 == 0) {
		printf("\n    в)Добуток всіх його цифр кратний чотирьом(%.0f * %.0f * %.0f * %.0f = %.0f)", a, b, c, d, a * b * c * d);
	}
	else {
		printf("\n    в)Добуток всіх його цифр НЕ кратний чотирьом(%.0f * %.0f * %.0f * %.0f = %.0f)", a, b, c, d, a * b * c * d);
	}

	if ((int)(a * b * c * d) % (int)a == 0) {
		printf("\n    г)Добуток всіх його цифр кратний %.0f(%.0f * %.0f * %.0f * %.0f = %.0f)", a, a, b, c, d, a * b * c * d);
	}
	else {
		printf("\n    г)Добуток всіх його цифр НЕ кратний %.0f(%.0f * %.0f * %.0f * %.0f = %.0f)", a, a, b, c, d, a * b * c * d);
	}
}

void task35() {
	printf("\n\nЗавдання 35: Програма — підлабузник. На екрані висвітлюється питання «Хто ти: хлопчик чи дівчинка? Введи Д або М». Залежно від відповіді на екрані має з'явитися текст <<Мені подобаються дівчата!>> або «Мені подобаються хлопчики!».");
	
	printf("\n    Хто ти: хлопчик чи дівчинка? Введи Д або М. ");
	char ans[10];

	scanf_s("%s", ans, 10);

	if (strcmp(ans, "Д") == 0 || strcmp(ans, "д") == 0 || strcmp(ans, "l") == 0 || strcmp(ans, "L") == 0) {
		printf("\n    Мені подобаються дівчата!");
	}

	else if (strcmp(ans, "М") == 0 || strcmp(ans, "м") == 0 || strcmp(ans, "v") == 0 || strcmp(ans, "V") == 0) {
		printf("\n    Мені подобається хлопчики!");
	}

	else {
		printf("\n Судячи по всьому, ти ввів якусь іншу букву.");
	}
}

void task91() {
	printf("\n\nЗавдання 91: У під'їзді житлового будинку є п квартир, пронумерованих поспіль, починаючи з номера a. Визначити, чи сума номерів усіх квартир є парним числом. Формулу суми членів арифметичної прогресії не використати.");
	int n = rand() % 50, a = rand() % 100, sum = 0;

	printf("\n    В цьому житловому будинку %d квартир, починаючи з номера %d.", n, a);

	for (int i = 0; i < n; i++) {
		sum += (i + a);
	}

	printf("\n    Загальна сума номерыв усых квартир - %d.", sum);

	if (sum % 2 == 0) {
		printf("\n    Сума номерів усіх квартир є парним числом.");
	}
	else {
		printf("\n    Сума номерів усіх квартир є НЕ парним числом.");
	}
}

void task82() {
	printf("\n\nЗавдання 82: Визначити, чи правильно, що з поділу неотрицательного цілого числа a на позитивне число b виходить залишок, що дорівнює одному з двох заданих чисел c або d.");
	int a = rand() % 100, b = rand() % 100 + 1, c = rand() % 50, d = rand() % 50;

	printf("\n     Значення: a = %d, b = %d, c = %d, а d = %d. Остача при діленні: a/b = %d", a, b, c, d, a % b);

	if (a % b == c || a % b == d) {
		printf("\n    Остача дійсно дорівнює %d або %d.", c, d);
	}
	else {
		printf("\n    Остача не дорівнює ні %d, ні %d.", c, d);
	}
}

void task14() {
	printf("\n\nЗавдання 14: Дано двозначне число. Визначити; а) чи трьома сума його цифр; б) кратна чи сума його цифр числу a.");
	int a = rand() % 9 + 1, b = rand() % 9 + 1;

	printf("\n    Введене число: %d%d", a, b);

	if ((a + b) % 3 == 0) {
		printf("\n    Сума його цифр кратна трьом(%d + %d = %d).", a, b, a + b);
	}
	else {
		printf("\n    Сума його цифр НЕ кратна трьом(%d + %d = %d).", a, b, a + b);
	}

	if ((a + b) % a == 0) {
		printf("\n    Сума його цифр кратна %d(%d + %d = %d).", a, a, b, a + b);
	}
	else {
		printf("\n    Сума його цифр НЕ кратна %d(%d + %d = %d).\n\n\n", a, a, b, a + b);
	}
}